#include <stdio.h>
#include <stdlib.h>

int main(){
    double matrix[9][9] = { // створення матриці
        {45.23, -91.34, 23.67, -76.12, 58.89, -33.45, 82.56, -14.78, -67.34},
        {-28.12, 72.45, -63.89, 49.78, -15.23, 96.34, -40.56, -29.89, -85.12},
        {53.67, -47.89, 92.12, -19.34, 64.45, -87.23, -36.78, -60.12, 83.45},
        {-17.89, 78.12, -31.23, 89.34, -55.67, -46.78, -92.45, 30.12, -74.89},
        {61.34, -42.23, 15.78, -87.12, 93.45, -19.78, 54.12, -32.89, 85.67},
        {-29.45, 90.23, -76.34, 48.12, -69.89, 27.56, -52.12, 83.34, -16.78},
        {72.56, -14.23, 65.12, -88.45, 39.78, -57.89, 91.34, -26.67, 44.12},
        {-13.78, 82.45, -68.12, 97.34, -33.45, 55.67, -41.23, 78.12, -53.89},
        {66.34, -37.12, 21.78, -90.45, 83.23, -19.56, 47.89, -61.34, 38.12}
    };
    int i = 0; //створення змінної для індексів
    int j = 0; //створення змінної для індексів
    // вивід початкової матриці
    printf("{\n");
    for (i = 0; i < 9; i++){
        printf("{");
        for (j = 0; j < 9; j++){
            if (j != 8){
                printf("%.2f\t", matrix[i][j]);
            }
            else {
                printf("%.2f", matrix[i][j]);
            }
        }
        printf("}");
        if (i != 8){
            printf("\n");
        }
        printf("\n");
    }
    printf("}\n");
    j = 0;
    while (j < 9){ //пошук першого від'ємного елемента побічної діагоналі
        if (matrix[8-j][j]<0){
            break;
        }
        j++;
    }
    double first_element = matrix[8-j][j]; //присвоєння змінній значення цього елемента
    printf("The first negative element of side diagonal is %.2f.\n", first_element); //вивід елемента
    i = 0;
    while (i < 9){ //пошук останнього додатнього елемента побічної діагоналі
        if (matrix[i][8-i]>0) {
            break;
        }
        i++;
    }
    double second_element = matrix[i][8-i]; //присвоєння змінній значення цього елемента
    printf("The last positive element of side diagonal is %.2f.\n", second_element); //вивід елемента
    // зміна елементів у матриці між собою
    matrix[8-j][j] = second_element;
    matrix[i][8-i] = first_element;
    // вивід зміненої матриці
    printf("{\n");
    for (i = 0; i < 9; i++){
        printf("{");
        for (j = 0; j < 9; j++){
            if (j != 8){
                printf("%.2f\t", matrix[i][j]);
            }
            else {
                printf("%.2f", matrix[i][j]);
            }
        }
        printf("}");
        if (i != 8){
            printf("\n");
        }
        printf("\n");
    }
    printf("}");
    return 0;
}
