#include <stdio.h>
#include <stdlib.h>

int main(){
    double matrix[10][10] = { //створення матриці
        {72.34, -58.12, 91.23, -49.56, 34.78, -83.67, 18.45, -75.12, 56.34, -20.78},
        {-37.89, 84.23, -61.12, 29.78, -94.34, 53.67, -22.45, 67.12, -89.34, 41.56},
        {19.45, -76.89, 62.34, -33.12, 85.78, -47.56, 92.23, 14.34, 64.45, -57.12},
        {-25.34, 68.45, -91.67, 34.12, -72.89, 46.78, -38.12, 93.56, -50.23, 17.89},
        {83.23, -19.12, 48.67, -66.34, 59.12, 32.45, 75.89, -22.34, 98.23, -55.67},
        {-41.56, 92.34, -27.89, 65.23, -73.45, 38.12, -49.34, 87.67, -15.78, 54.12},
        {31.45, -62.34, 99.12, 43.78, 71.23, -18.56, 52.78, -84.12, 66.34, -29.45},
        {-13.67, 77.89, -58.45, 40.12, -90.34, 35.67, -76.23, 19.78, -53.12, 68.45},
        {54.12, 38.45, 87.23, -25.12, 61.34, -79.67, 93.45, -46.12, 32.78, -70.89},
        {29.34, 55.78, -67.12, 98.23, -17.45, 82.56, -41.12, 74.89, -12.67, 63.23}
    };
    int i = 0; //створення змінної для індексів
    int j = 0; //створення змінної для індексів
    // вивід початкової матриці
    printf("{\n");
    for (i = 0; i < 10; i++){
        printf("{");
        for (j = 0; j < 10; j++){
            if (j != 9){
                printf("%.2f\t", matrix[i][j]);
            }
            else {
                printf("%.2f", matrix[i][j]);
            }
        }
        printf("}");
        if (i != 9){
            printf("\n");
        }
        printf("\n");

    }
    printf("}\n");
    j = 0;
    while (j < 10){ //пошук першого від'ємного елемента побічної діагоналі
        if (matrix[9-j][j]<0){
            break;
        }
        j++;
    }
    double first_element = matrix[9-j][j]; //присвоєння змінній значення цього елемента
    printf("The first negative element of side diagonal is %.2f.\n", first_element); //вивід елемента
    i = 0;
    while (i < 10){ //пошук останнього додатнього елемента побічної діагоналі
        if (matrix[i][9-i]>0) {
            break;
        }
        i++;
    }
    double second_element = matrix[i][9-i]; //присвоєння змінній значення цього елемента
    printf("The last positive element of side diagonal is %.2f.\n", second_element); //вивід елемента
    // зміна елементів у матриці між собою
    matrix[9-j][j] = second_element;
    matrix[i][9-i] = first_element;
    // вивід зміненої матриці
    printf("{\n");
    for (i = 0; i < 10; i++){
        printf("{");
        for (j = 0; j < 10; j++){
            if (j != 9){
                printf("%.2f\t", matrix[i][j]);
            }
            else {
                printf("%.2f", matrix[i][j]);
            }
        }
        printf("}");
        if (i != 9){
            printf("\n");
        }
        printf("\n");
    }
    printf("}");
    return 0;
}
